Dlubal.RFEM5.UserCoordinateSystem
User-defined coordinate system parameters

Dlubal.RFEM5.UserCoordinateSystem.No
Number

Dlubal.RFEM5.UserCoordinateSystem.ID
Identifier

Dlubal.RFEM5.UserCoordinateSystem.Tag
Tag

Dlubal.RFEM5.UserCoordinateSystem.IsValid
Information if the object is valid or not (read only)

Dlubal.RFEM5.UserCoordinateSystem.Name
Name

Dlubal.RFEM5.UserCoordinateSystem.OriginNo
Number of the origin node

Dlubal.RFEM5.UserCoordinateSystem.Origin
Absolute coordinates of the origin point

Dlubal.RFEM5.UserCoordinateSystem.Point1No
Node number on positive U-axis

Dlubal.RFEM5.UserCoordinateSystem.Point1
Absolute coordinates of the point on positive U-axis

Dlubal.RFEM5.UserCoordinateSystem.Point2No
Node number in positive UW-plane

Dlubal.RFEM5.UserCoordinateSystem.Point2
Absolute coordinates of the point on positive UW-plane

Dlubal.RFEM5.UserCoordinateSystem.Comment
Comment